
# P(B) 必须大于 1/2
# 要求 P(BB) 必须是两个接近 3/4 的分数相乘
#
# 分母是两个连续整数相乘
# 分子除 2 后可表为两个连续整数相乘
# 这两个连续整数一定是分子除 2 后的天花板和地板

# 输出前面的蓝色与总碟子数目比值，发现会趋于 0.707107...
# 707107*707108*2 = 1000002033112，约等于 1e12，题目故意设计好的！
#
# 以上是理论上可行的算法，但是电脑计算速度不够，算不了
#
# (B(B-1)) / (T(T-1)) = 1/2  ==>  (2T-1)^2 - 2(2B-1)^2 = -1
# 令 x = 2T-1, y=2B-1  ==>  x^2 - 2y^2 = -1
# 得到 Pell 方程
# (x(1), y(1)) = (1, 1)
# x(n+1) = 3x(n) + 4y(n)
# y(n+1) = 2x(n) + 3y(n)
# (x(2), y(2)) = (7, 5)  ==>  (T, B) = (4, 3)
# (x(3), y(3)) = (41, 29)  ==>  (T, B) = (21, 5)


x = 1
y = 1
while (x+1)/2 < 10**12:
  x, y = 3*x+4*y, 2*x+3*y
print(int((y+1)/2))